#+TITLE: September 30, 2019 - October 12, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-09-30 Mon>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-sandeepk: 1.84
  :END:
** akshay196
*** DONE Mastering Python Design Patterns - Part I [7/7]
    CLOSED: [2019-10-14 Mon 13:31]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   4.30
    :OWNER: akshay196
    :ID: READ.1569864940
    :TASKID: READ.1569864940
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-10 Thu 20:30]--[2019-10-10 Thu 20:59] =>  0:29
    CLOCK: [2019-10-09 Wed 18:41]--[2019-10-09 Wed 19:13] =>  0:32
    CLOCK: [2019-10-09 Wed 07:58]--[2019-10-09 Wed 08:43] =>  0:45
    CLOCK: [2019-10-08 Tue 07:01]--[2019-10-08 Tue 07:43] =>  0:42
    CLOCK: [2019-10-06 Sun 14:53]--[2019-10-06 Sun 15:29] =>  0:36
    CLOCK: [2019-10-04 Fri 07:30]--[2019-10-04 Fri 07:57] =>  0:27
    CLOCK: [2019-10-02 Wed 20:34]--[2019-10-02 Wed 21:18] =>  0:44
    CLOCK: [2019-10-02 Wed 10:39]--[2019-10-02 Wed 10:42] =>  0:03
    :END:
    Second Edition. by Sakis Kasampalis, Kamon Ayeva.
    https://learning.oreilly.com/library/view/mastering-python-design/9781788837484/
    - [X] The factory method                               (1h)
    - [X] The abstract factory                             (1h)
    - [X] The Builder Pattern                              (1h)
    - [X] The prototype pattern                            (1h)
    - [X] Singleton                                        (1h)
    - [X] The Adapter Pattern                              (1h)
    - [X] The Decorator Pattern                            (1h)
** bhavin192
*** DONE Attend PyCon India 2019
    CLOSED: [2019-10-12 Sat 18:30]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   11.08
    :OWNER:    bhavin192
    :ID:       EVENT.1570037556
    :TASKID:   EVENT.1570037556
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-12 Sat 07:45]--[2019-10-12 Sat 18:50] => 11:05
    :END:
** gandalfdwite
*** DONE Cloud Native DevOps Part - II [5/5]
    CLOSED: [2019-10-10 Thu 18:45]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:   12.12
    :OWNER: gandalfdwite
    :ID: READ.1568308423
    :TASKID: READ.1568308423
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-09 Wed 22:25]--[2019-10-09 Wed 14:49] => -7:36
    CLOCK: [2019-10-07 Mon 19:15]--[2019-10-07 Mon 20:49] =>  1:34
    CLOCK: [2019-10-08 Tue 11:07]--[2019-10-08 Tue 12:49] =>  1:42
    CLOCK: [2019-10-07 Mon 19:15]--[2019-10-07 Mon 20:49] =>  1:34
    CLOCK: [2019-10-06 Sun 14:45]--[2019-10-06 Sun 16:15] =>  1:30
    CLOCK: [2019-10-05 Sat 10:15]--[2019-10-05 Sat 11:49] =>  1:34
    CLOCK: [2019-10-04 Fri 17:35]--[2019-10-04 Fri 18:49] =>  1:14
    CLOCK: [2019-10-02 Wed 19:00]--[2019-10-02 Wed 21:15] =>  2:15
    CLOCK: [2019-10-01 Tue 23:15]--[2019-10-02 Wed 00:15] =>  1:00
    CLOCK: [2019-09-30 Mon 21:07]--[2019-09-30 Mon 22:25] =>  1:18


    :END:
    - [X] 8. Running Containers                ( 2h )
    - [X] 9. Managing Pods                     ( 2h )
    - [X] 10 Configuration and Secrets         ( 2h )
    - [X] 11 Security and Backups              ( 2h )
    - [X] 12. Deploying Kubernetes Applications ( 3h )
*** DONE Write a Blog Post [1/1]
    CLOSED: [2019-10-17 Thu 00:45]
   :PROPERTIES:
   :ESTIMATED: 2
   :ACTUAL:   2.48
   :OWNER: gandalfdwite
   :ID: DO.1569769174
   :TASKID: DO.1569769174
   :END:
   :LOGBOOK:
   CLOCK: [2019-10-16 Wed 23:03]--[2019-10-17 Thu 00:22] =>  1:19
   CLOCK: [2019-10-11 Fri 18:45]--[2019-10-11 Fri 19:55] =>  1:10
   :END:

   - [X] Blog Post on using Argo             ( 2h )

** sandeepk
*** DONE 2PI Research [Slack Bot] [2/2]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:   4.17
    :OWNER: sandeepk
    :ID: READ.1569958301
    :TASKID: READ.1569958301
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-08 Tue 16:00]--[2019-10-08 Tue 17:40] =>  1:40
    CLOCK: [2019-10-06 Sun 17:00]--[2019-10-06 Sun 18:20] =>  1:20
    CLOCK: [2019-10-04 Fri 22:20]--[2019-10-04 Fri 23:30] =>  1:10
    :END:
    - [X] https://api.slack.com/tutorials/tags/python                             (4h)
    - [X] https://www.fullstackpython.com/blog/build-first-slack-bot-python.html  (3h)
*** DONE [#B] Dive into Python3 [2/2]
    :PROPERTIES:
    :ESTIMATED: 7 
    :ACTUAL:   6.08
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    :LOGBOOK:
    CLOCK: [2019-10-12 Sat 22:10]--[2019-10-12 Sat 23:50] =>  1:40
    CLOCK: [2019-10-10 Thu 23:10]--[2019-10-11 Fri 00:30] =>  1:20
    CLOCK: [2019-10-09 Wed 20:40]--[2019-10-09 Wed 21:55] =>  1:15
    CLOCK: [2019-10-02 Wed 22:40]--[2019-10-02 Wed 23:30] =>  0:50
    CLOCK: [2019-10-01 Tue 22:00]--[2019-10-01 Tue 23:00] =>  1:00
    :END:
    - [X] Serializing Python Objects              (3h)
    - [X] HTTP Web Services                       (4h)



